---
kind: type
id: T:Autodesk.Revit.DB.Architecture.Stairs
zh: 楼梯
source: html/45e2c068-7e52-c84a-cfb8-a53c531d28fa.htm
---
# Autodesk.Revit.DB.Architecture.Stairs

**中文**: 楼梯

Represents a stairs element in Autodesk Revit.

## Syntax (C#)
```csharp
public class Stairs : Element
```

## Remarks
This element may represent a standalone Stairs element, or a member of a MultistoryStairs element.
 Use MultistoryStairsId to identify if this Stairs element is a part of a MultistoryStairs.